a1 = int(input("Введите первый элемент прогрессии: "))
d = int(input("Введите разность прогрессии: "))
n = int(input("Введите количество элементов в прогрессии: "))

for i in range(n): # Используем цикл для вычисления каждого элемента прогрессии и вывода каждого элемента на новой строке
    an = a1 + (i * d) # Используем формулу для вычисления каждого элемента прогрессии
    print(an)

import random

min_value = int(input("Введите минимальное значение диапазона: "))
max_value = int(input("Введите максимальное значение диапазона: "))

array = [random.randint(-100, 100) for _ in range(10)] # Заполнить массив случайными числами
print (array)

indexes = [] # Создать пустой список для индексов элементов, значения которых принадлежат заданному диапазону

for i in range(len(array)): # Используем цикл для проверки каждого элемента массива
    if min_value <= array[i] <= max_value: # Проверяем, принадлежит ли значение элемента заданному диапазону
        indexes.append(i) # Если да, добавляем индекс элемента в список индексов

print("Индексы элементов, значения которых принадлежат заданному диапазону:", indexes) # Выводим список индексов на экран
